In [29]:
import pandas as pd

In [30]:
df = pd.read_csv("heart_v2.csv")
df.head(10)

   age  sex   BP  cholestrol  heart disease
0   70    1  130         322              1
1   67    0  115         564              0
2   57    1  124         261              1
3   64    1  128         263              0
4   74    0  120         269              0
5   65    1  120         177              0
6   56    1  130         256              1
7   59    1  110         239              1
8   60    1  140         293              1
9   63    0  150         407              1

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 270 entries, 0 to 269
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   age            270 non-null    int64
 1   sex            270 non-null    int64
 2   BP             270 non-null    int64
 3   cholestrol     270 non-null    int64
 4   heart disease  270 non-null    int64
dtypes: int64(5)
memory usage: 10.7 KB

In [32]:
df.isna().sum()

age              0
sex              0
BP               0
cholestrol       0
heart disease    0
dtype: int64

In [33]:
df.describe()

              age         sex          BP  cholestrol  heart disease
count  270.000000  270.000000  270.000000  270.000000     270.000000
mean    54.433333    0.677778  131.344444  249.659259       0.444444
std      9.109067    0.468195   17.861608   51.686237       0.497827
min     29.000000    0.000000   94.000000  126.000000       0.000000
25%     48.000000    0.000000  120.000000  213.000000       0.000000
50%     55.000000    1.000000  130.000000  245.000000       0.000000
75%     61.000000    1.000000  140.000000  280.000000       1.000000
max     77.000000    1.000000  200.000000  564.000000       1.000000

In [34]:
df.rename(columns={'cholestrol':'cholesterol'},inplace=True)
df.head()

   age  sex   BP  cholesterol  heart disease
0   70    1  130          322              1
1   67    0  115          564              0
2   57    1  124          261              1
3   64    1  128          263              0
4   74    0  120          269              0

In [35]:
df['sex']=df['sex'].replace({0:'Female',1:'Male'})
df.head()

   age     sex   BP  cholesterol  heart disease
0   70    Male  130          322              1
1   67  Female  115          564              0
2   57    Male  124          261              1
3   64    Male  128          263              0
4   74  Female  120          269              0

In [ ]:
def classify_age(age):
    if age < 40:
        return 'Young'
    elif age <= 60:
        return 'Middle-aged'
    else:
        return 'Senior'


df['age_group'] = df['age'].apply(classify_age)

df.head(5)

   age     sex   BP  cholesterol  heart disease    age_group
0   70    Male  130          322              1       Senior
1   67  Female  115          564              0       Senior
2   57    Male  124          261              1  Middle-aged
3   64    Male  128          263              0       Senior
4   74  Female  120          269              0       Senior

In [ ]:
import seaborn as sns
import matplotlib.pyplot as plt

In [ ]:
df['heart disease'].value_counts()

heart disease
0    150
1    120
Name: count, dtype: int64

In [ ]:
df.groupby('age_group').agg({'BP':['mean'],'cholesterol':['mean']})

                     BP cholesterol
                   mean        mean
age_group
Middle-aged  130.086022  245.478495
Senior       136.041667  264.652778
Young        122.666667  224.500000